In [1]:
import pandas as pd

In [2]:
friends = [{'name' : 'Jone', 'age': 20, 'job' : 'student'},
           {'name' : 'Jenny', 'age': 30, 'job' : None},
           {'name' : 'Nate', 'age': 25, 'job' : 'teacher'},]
df = pd.DataFrame(friends)
df = df[['name', 'age', 'job']]

In [3]:
df.head()

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   25  teacher

In [9]:
df.to_csv('friends.csv', index = False, header = True, na_rep = '-') 
#인덱스와 헤더는 디폴트
#인덱스와 헤더를 False로 바꾸면 안나옴
#None 값은 빈칸, na_rep를 통해 원하는 값을 넣을 수 있다